In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [2]:
#数据清洗与准备
data=pd.Series(list('abcde'))

In [3]:
data

0    a
1    b
2    c
3    d
4    e
dtype: object

In [4]:
data[0]=np.nan

In [5]:
data

0    NaN
1      b
2      c
3      d
4      e
dtype: object

In [6]:
data.isnull()

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [7]:
data.dropna()

1    b
2    c
3    d
4    e
dtype: object

In [8]:
data1=pd.DataFrame([[1,2,3],[1,None,None],[None,None,None],[None,2,3]])

In [9]:
data1

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  2.0  3.0

In [10]:
data1.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  NaN
3  NaN  2.0  3.0

In [11]:
df=pd.DataFrame(np.random.randn(7,3))

In [12]:
df

          0         1         2
0 -0.335590 -0.036994  0.424859
1 -0.395733  0.669580  0.965072
2 -0.562372 -0.017402 -0.197294
3  2.174325 -0.408597  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [13]:
df.iloc[:4,1]=np.nan

In [14]:
df.iloc[:2,2]=np.nan

In [15]:
df

          0         1         2
0 -0.335590       NaN       NaN
1 -0.395733       NaN       NaN
2 -0.562372       NaN -0.197294
3  2.174325       NaN  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [16]:
df.dropna(thresh=2)

          0         1         2
2 -0.562372       NaN -0.197294
3  2.174325       NaN  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [17]:
df

          0         1         2
0 -0.335590       NaN       NaN
1 -0.395733       NaN       NaN
2 -0.562372       NaN -0.197294
3  2.174325       NaN  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [18]:
a=df.fillna(np.std(df[1]))

In [19]:
df

          0         1         2
0 -0.335590       NaN       NaN
1 -0.395733       NaN       NaN
2 -0.562372       NaN -0.197294
3  2.174325       NaN  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [20]:
a

          0         1         2
0 -0.335590  0.805556  0.805556
1 -0.395733  0.805556  0.805556
2 -0.562372  0.805556 -0.197294
3  2.174325  0.805556  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [21]:
df.fillna(method='bfill')

          0         1         2
0 -0.335590  1.307940 -0.197294
1 -0.395733  1.307940 -0.197294
2 -0.562372  1.307940 -0.197294
3  2.174325  1.307940  1.039810
4 -0.468282  1.307940 -1.686272
5  0.052338 -0.600883  0.150579
6 -0.127277  0.786473 -0.797260

In [22]:
#数据转换
data2=pd.DataFrame({
    'k1':['one','two']*3+['two'],
    'k2':[1,1,2,3,3,4,4]
})

In [23]:
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [24]:
data2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [25]:
data2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [26]:
data2.drop_duplicates(['k1'],keep='last')

    k1  k2
4  one   3
6  two   4

In [27]:
#使用函数或映射进行数据转换

In [28]:
data=pd.DataFrame({
    'food':list('abcde'),
    'name':list('feghi')
})

In [29]:
data

  food name
0    a    f
1    b    e
2    c    g
3    d    h
4    e    i

In [30]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon','pastrami', 'corned beef','bacon','pastrami', 'honey ham', 'novalox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,6]})

In [31]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [32]:
meat_to_animal={
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'novalox': 'salmon'
}

In [33]:
lower=data['food'].str.lower()

In [34]:
lower

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [35]:
data['animal']=lower.map(meat_to_animal)

In [36]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [37]:
data=data.drop(['animal'],axis=1)

In [38]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [39]:
data['animal']=data['food'].map(lambda x: meat_to_animal[x.lower()])

In [40]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [41]:
#替代者
data=pd.Series(range(5,10))

In [42]:
data

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [43]:
data.replace([5,6,7],np.nan)

0    NaN
1    NaN
2    NaN
3    8.0
4    9.0
dtype: float64

In [44]:
#重命名轴索引

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                        index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
transform = lambda x: x[:4].upper()

In [48]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [49]:
data.index=data.index.map(transform)

In [50]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [51]:
data.rename(index=str.title ,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [52]:
#inplace=True直接修改原有数据集
data.rename(index={'OHIO':'huangyu'},inplace=True)

In [53]:
data

         one  two  three  four
huangyu    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [54]:
#离散化和分箱你

In [55]:
age=[]
for i in range(0,20,2):
    age.append(i)

In [56]:
age

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

In [57]:
bin=[0,4,8,15,20]
cats=pd.cut(age,bin,right=False,labels=['a','b','c','d'])

In [58]:
cats

[a, a, b, b, c, c, c, c, d, d]
Categories (4, object): [a < b < c < d]

In [59]:
#查看数据属于哪个箱子
cats.codes

array([0, 0, 1, 1, 2, 2, 2, 2, 3, 3], dtype=int8)

In [60]:
cats.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [61]:
pd.value_counts(cats)

c    4
d    2
b    2
a    2
dtype: int64

In [62]:
#检测和过滤异常值

In [63]:
data=pd.DataFrame(np.random.randn(1000,4))

In [64]:
data

            0         1         2         3
0   -0.372650  1.862825 -0.406009  0.352846
1   -0.139013  0.115183 -0.378786 -1.804958
2   -0.049051 -1.178190 -1.054381 -1.512082
3   -0.628919 -0.424836  0.752043  0.390255
4   -1.080373 -0.201942 -1.733297  0.553429
5    0.671839 -1.011897  0.615191  0.448903
6    0.213662 -0.132757 -0.655212  2.833035
7   -1.034632  0.927490 -0.520183  0.233566
8    0.263128 -1.534827  1.108245  0.731329
9    1.368948 -0.534141 -0.583667  2.343468
10   0.739403 -0.245411  1.219453 -1.860769
11   1.212204 -0.218673  2.383289 -0.033345
12   0.567815  0.492756 -0.311512  0.113279
13   0.040795  2.363227 -1.041256 -1.407783
14  -0.223920  0.196573  0.248613  0.716945
15   0.751715  0.537713  0.907620  1.588739
16  -1.203824 -0.729591 -0.262690  1.236556
17  -0.140018  1.118805 -0.347362 -0.250470
18  -0.786743 -0.522138  0.230882 -0.747536
19  -0.448213  1.326067 -0.169557  0.827240
20  -0.314164 -0.492685  0.107711 -0.763507
21   0.223500 -0.905698 -0.361839  0.092176
22   1.512702  0.915618 -1.320229 -1.243233
23  -0.268204 -1.576956  0.284534 -0.044830
24  -0.175974 -0.748792 -0.036495 -0.499647
25  -0.361647 -1.254119  0.099081 -0.450394
26  -1.953496  0.595255 -0.445113 -0.097369
27   0.196333  0.101383 -0.964437 -1.155442
28  -0.059803  0.565419 -0.778778 -0.848525
29  -0.894736 -0.593425 -0.273362 -0.585923
..        ...       ...       ...       ...
970 -0.545802 -0.118789  0.084440  1.003573
971 -0.220746 -1.467164  1.653551 -0.243115
972 -0.618659 -1.279678  0.948181  0.005240
973 -0.252907  0.303732 -0.108453  1.519940
974  0.281743 -0.219349 -1.198858  0.601235
975  0.100284 -0.159277 -1.155755 -1.103109
976  0.045407 -1.274943 -0.667593  0.120825
977  1.184875  0.180382  0.006635  1.125715
978 -0.630915  0.910954  0.460033 -0.520342
979  1.079563  1.127620 -0.452216 -1.311439
980 -1.331867 -0.282772 -1.787832 -0.124978
981 -0.989980 -0.255350  1.126339  0.813019
982  0.073346 -0.836877  0.156287 -2.095865
983 -1.232133  0.759822  1.350202 -0.334931
984  0.520562 -0.121664 -0.239384 -1.413454
985  0.803617  1.346017  0.510590 -1.101422
986  0.679587 -1.200421  1.267762 -0.187121
987  0.247546 -0.211224  0.428452  0.264260
988 -1.504753 -1.463353  1.821666  0.064876
989  1.008347 -0.810628  0.038200 -0.919587
990  0.848000 -0.309656  0.238397 -0.569071
991  1.368292  0.383296 -0.715115 -0.478686
992 -2.398379  1.568068  1.563454 -0.160095
993 -2.147576 -0.424383 -1.142719 -0.075935
994 -1.185897  0.669818  0.364671  1.183500
995 -1.402964 -0.507708 -0.107344  0.943730
996 -0.737713 -0.511732 -0.264952  0.264292
997 -0.055420 -1.021713 -0.804883 -1.390514
998 -1.720296  0.480305  1.518859  1.332841
999  0.149698 -0.233487  1.531607  1.169778

[1000 rows x 4 columns]

In [65]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003250    -0.010076    -0.045224    -0.008336
std       0.999303     1.008335     1.008655     0.951440
min      -2.930667    -2.811707    -4.191152    -3.003642
25%      -0.682336    -0.751703    -0.746157    -0.692586
50%      -0.018809     0.029010    -0.085547    -0.013696
75%       0.683794     0.686450     0.611221     0.632373
max       3.656498     3.235704     3.092682     2.833035

In [66]:
col=data[2]

In [67]:
col[np.abs(col) > 3]

254   -4.191152
485    3.092682
648    3.087281
713   -3.445212
Name: 2, dtype: float64

In [68]:
data[(np.abs(data)>3).any(1)]=np.sign(data)*3

In [69]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1 -1.0  1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [70]:
#计算指标或虚拟变量

In [71]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [72]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [73]:
df.join(pd.get_dummies(df['key'],prefix='key'))

  key  data1  key_a  key_b  key_c
0   b      0      0      1      0
1   b      1      0      1      0
2   a      2      1      0      0
3   c      3      0      0      1
4   a      4      1      0      0
5   b      5      0      1      0

In [74]:
#字符串操作

In [75]:
val = 'a , b, guido'

In [76]:
val.split(',')

['a ', ' b', ' guido']

In [77]:
pi=[x.strip() for x in val.split(',')]

In [78]:
pi

['a', 'b', 'guido']

In [79]:
pi

['a', 'b', 'guido']

In [81]:
pi1=":".join(pi)

In [82]:
pi1.replace(':',' ')

'a b guido'

### 正则表达式等一等

In [83]:
#数据规整：连接、联合与重塑

In [84]:
#分层索引
data = pd.Series(np.random.randn(9),
 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c','d', 'd'], [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [85]:
data

a  1   -0.610061
   2   -1.002566
   3    0.126997
b  1   -1.258056
   3    0.924921
c  1   -0.411127
   2    0.525490
d  2    0.632523
   3    0.782146
dtype: float64

In [86]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [87]:
data['a']

1   -0.610061
2   -1.002566
3    0.126997
dtype: float64

In [88]:
data['a':'b']

a  1   -0.610061
   2   -1.002566
   3    0.126997
b  1   -1.258056
   3    0.924921
dtype: float64

In [89]:
data.loc[:,2]

a   -1.002566
c    0.525490
d    0.632523
dtype: float64

In [90]:
data.unstack()

          1         2         3
a -0.610061 -1.002566  0.126997
b -1.258056       NaN  0.924921
c -0.411127  0.525490       NaN
d       NaN  0.632523  0.782146

In [91]:
data.unstack().stack()

a  1   -0.610061
   2   -1.002566
   3    0.126997
b  1   -1.258056
   3    0.924921
c  1   -0.411127
   2    0.525490
d  2    0.632523
   3    0.782146
dtype: float64

In [92]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1,2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [93]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [94]:
frame.index.names=['key1','key2']

In [95]:
frame.columns.names=['state','color']

In [96]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [97]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [98]:
#重排序和层级排序

In [102]:
#交换行索引的顺序
frame.swaplevel('key2','key1')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [103]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [104]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [107]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [108]:
#按层级进行汇总统计

In [110]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [114]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [115]:
#使用DataFrame的列进行索引

In [116]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two','two','two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})

In [117]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [118]:
frame1=frame.set_index(['c','d'])

In [119]:
frame1

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [120]:
#默认的话是删除这些列，但是也可保留下来

In [121]:
frame2=frame.set_index(['c','d'],drop=False)
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [122]:
#返回操作
frame1.reset_index(['c','d'])

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [123]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [125]:
#数据库风格的DataFrame的连接

In [126]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a',
'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [127]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [128]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [131]:
#内连接
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [133]:
#外连接，保证所有数据存在
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [134]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a','b'])

In [135]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [136]:
right1

   group_val
a        3.5
b        7.0

In [137]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0